{"12": {"title": "ApeironX ExcelSaga.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "04/11/2006", "size": "9.30 MB", "votes": 13, "stars": 3.076925, "downloads": 4975, "identifier": 12, "filepath": "Miscellaneous/12_ApeironX_ExcelSaga.sit.hqx", "description": "Anime madness--Puchuus have invaded the world, but Excle Excel is not about to let them take over F City before Lord Ilpalazzo has his own chance at conquest! Music, backgrounds and sound effects from the series."}, "11": {"title": "apeiron editing.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "10/03/2005", "size": "13.00 kB", "votes": 7, "stars": 2.714285, "downloads": 2989, "identifier": 11, "filepath": "Miscellaneous/11_apeiron_editing.sit.hqx", "description": "This is an HTML resource to help you make your own Apeiron conversions!  It contains links to shareware and freeware tools which will be useful, instructions on using ResPloder to open Apeiron's resource files, and listings and descriptions of the editable sprites, titles, sound effects and music files, along with tips on how to convert them. By Inkwolf"}, "13": {"title": "ApeironX Star WarsSE.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "10/03/2005", "size": "4.70 MB", "votes": 15, "stars": 2.666665, "downloads": 5783, "identifier": 13, "filepath": "Miscellaneous/13_ApeironX_Star_WarsSE.sit.hqx", "description": "Star Wars SE for Apeiron!  In the days of Classic Apeiron, a Star Wars Modification was made for Apeiron by the legendary Jedi Master Frank Bannon, and the people rejoiced.  With the advent of ApeironX and the disappearance of Bannon, a Star Wars junkie Padawan named Inkwolf felt the loss of the master's work, and decided to follow in George Lucas's footsteps by recreating the lost treasure with more modern, more awesome graphics.  This Special Edition Star Wars modification contains art by Inkwolf, Frank Bannon's original sound effects file, and a choice of three John Williams soundtracks."}, "10": {"title": "apeiron aquamod.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "02/01/2005", "size": "4.10 MB", "votes": 8, "stars": 2.625, "downloads": 4395, "identifier": 10, "filepath": "Miscellaneous/10_apeiron_aquamod.sit.hqx", "description": "Apeiron Aquamod. Alternate graphics, sprites, and sounds put a whole new spin on this classic arcade shooter."}}