{"120": {"title": "Ares Music.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "13.00 MB", "votes": 11, "stars": 5.0, "downloads": 5482, "identifier": 120, "filepath": "Utilities/120_Ares_Music.sit.bin", "description": "Ares Music. Five of the songs from Ares in mp3 form: Doomtroopers Unite!, Autoregret, Eyes of Fire, F.R.E.D.'s Theme and Getalong. Converted by Nathan Lamont. Orginally produced by Nathan Lamont and Owen Lamont. Uploaded by Patrick."}, "121": {"title": "Ares Music2.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "8.60 MB", "votes": 11, "stars": 4.90909, "downloads": 4580, "identifier": 121, "filepath": "Utilities/121_Ares_Music2.sit.bin", "description": "Ares Music v2. Three of the songs from Ares in mp3 form: Moonrise Patrol, Targetron and Technobee. Converted by Nathan Lamont. Orginally produced by Nathan Lamont. Uploaded by Patrick."}, "128": {"title": "Extra Things for plug", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "1.50 MB", "votes": 9, "stars": 4.88889, "downloads": 2479, "identifier": 128, "filepath": "Utilities/128_Extra_Things_for_plug.sit", "description": "Are you tired of the explosions that ares have... well nows your chance to get a completly new set  with higher quality) I't also includes some new space things and a plug that shows how to use them. Like always I hope someone out there will have some kind of use for this. Created and uploaded by VIPER"}, "18": {"title": "Extreme Speeds Ares Guide", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "16.00 kB", "votes": 5, "stars": 4.8, "downloads": 2743, "identifier": 18, "filepath": "Guides/18_Extreme_Speeds_Ares_Guide", "description": "Yes, my own guide.  It tells you the advantages and disadvantages of every race that I've noticed, my evalautions on every ship in the game, my strategies for each level, strategies (if they could be called that) for the net levels, and some hints.  Also, it contains my email address, for those who have been wanting/needing to email me.  Its in Simple Text format, so it should be readable on any mac.  However, Simple Text had to be mean and force me to make it into two files.  If I left out anything or have any typos, let me know.  I might create a better guide with a better program sooner or later."}, "137": {"title": "Plug developer extra", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "3.80 MB", "votes": 12, "stars": 4.666665, "downloads": 2036, "identifier": 137, "filepath": "Utilities/137_Plug%20developer%20extra.sit", "description": "Well I have put up this plug thing for the lazy people that dont want to do there own graphic and sounds. There are only one complete race but there are also 6 fighters, 8 cruisers, 9 gunships, 8 carriers, 4 heavy destroyers and 4 transports to chose frome all with a different look. And as a bonus i have given away all my 35 planets sprites 25 of them are like the ones in ares but 10 are animated oh and there are allso 6 sounds,16 new weapons and some explosions. All these thing are old stuff that i made about 2 years ago. \r\nViper \r\ntmq932x@tninet.se"}, "38": {"title": "ColdDaysLongNights.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/02/2005", "size": "1.10 MB", "votes": 22, "stars": 4.636365, "downloads": 4313, "identifier": 38, "filepath": "Scenarios/38_ColdDaysLongNights.sit.hqx", "description": "Cold Days and Long Nights is a plugin that charts the development of the nascent Human empire as it struggles against old and new foes in a realistic post-Ares universe.  Human ships have been completely redesigned and rearmed, and include some novel new weapons (especially cruisers).  Many of the missions have been heavily scripted, most have strings and briefings, and all follow a cohesive narrative.  The plot is extremely ambitious and attempts to tie many strands of the Ares universe together.  CDALN includes 10 complete missions, with more on the way if the initial reception is good."}, "63": {"title": "Footsteps of Pyrrhus.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.60 MB", "votes": 87, "stars": 4.505745, "downloads": 1897, "identifier": 63, "filepath": "Scenarios/63_Footsteps%20of%20Pyrrhus.sit.Bin", "description": "Follow the course of a desperate war waged by a fledgeling race on the brink of extinction. Test your piloting prowess in half a dozen new vessels over the course of thirteen missions featuring some of the most sophisticated coding yet seen in a plug-in. Are you ready for it? Footsteps of Pyrrhus 1.0.1 -Sundered Angel "}, "114": {"title": "War", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "349.00 kB", "votes": 5, "stars": 4.4, "downloads": 2505, "identifier": 114, "filepath": "Scenarios/114_War", "description": "War: The new generation of net games. Includes several new ships and new concepts, such as recycling wreckage for money. PPC recommended. - Submitted by Anonymous"}, "52": {"title": "Doom .sit", "category": "Scenarios", "author": "Anonymous", "date": "03/31/2008", "size": "102.00 kB", "votes": 3, "stars": 4.333335, "downloads": 2174, "identifier": 52, "filepath": "Scenarios/52_Doom_.sit.hqx", "description": "In Doom, you play the part of a UNS Commander who has been selected to Command the UNS's newest capital ship. The story involves fighting almost every race the game has to offer, becoming allies with the ones you don't fight, and begins about 60 years after the point where Ares left off. Read the ReadMe and the new game intro for more information. Enjoy!"}, "71": {"title": "Infestation.sit", "category": "Scenarios", "author": "Anonymous", "date": "05/08/2007", "size": "17.00 kB", "votes": 7, "stars": 4.285715, "downloads": 2001, "identifier": 71, "filepath": "Scenarios/71_Infestation.sit.bin", "description": "Infestation 1.0.0: In this new scenario by Consul Bob, a lone UNS patrol fleet is sent to scan and clear out a remote sector of a new, but familiar menace. Forward all flames to consul.bob@gmail.com."}, "51": {"title": "Domination", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "277.00 kB", "votes": 4, "stars": 4.25, "downloads": 2492, "identifier": 51, "filepath": "Scenarios/51_Domination", "description": "One day, I was just lying around, bored, with nothing to do. So I made a net level. This is the end result. The concept was taken directly from Unreal Tournament. First one to reach 100 points wins."}, "95": {"title": "ShootoutAtMidnight", "category": "Scenarios", "author": "Anonymous", "date": "02/19/2005", "size": "16.00 kB", "votes": 4, "stars": 4.25, "downloads": 2264, "identifier": 95, "filepath": "Scenarios/95_ShootoutAtMidnight.sit", "description": "Shootout At Midnight has several standard and modified Ares missions, in addition to the original net levels, and should provide hours of Ares-style enemy-blasting fun.\r\n\r\nVersion: 1.0.\r\nRelease Date: 2/19/04\r\n-Consul Bob"}, "62": {"title": "FighterPower v1.0.2", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "22.00 kB", "votes": 10, "stars": 4.2, "downloads": 1835, "identifier": 62, "filepath": "Scenarios/62_FighterPower%20v1.0.2.sit", "description": "Ever want to kick butt in a fighter? You can, without even cheating. This\r\nplugin is a set of training missions to improve your skills with basic\r\nfighters. First to qualify you have to test your skills against other fighters\r\nand then you're off to training. Skilled pilots required, there's no room for\r\nrookies in here. This is version 1.0.2.  It has some fixes, see the version history in the readme for more info."}, "80": {"title": "Malamar ", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.40 MB", "votes": 15, "stars": 4.2, "downloads": 3076, "identifier": 80, "filepath": "Scenarios/80_Malamar_.hqx", "description": "This plug allows you to take the Malamar ships through all of the standard Ares missions, just like many of Chris Shrouts plugs. Anyway, I hope you like it. It doesn't have any of the briefings changed, but it does have a short commentary that tells the story of the Malamar, and also gives detailed information about the ships.\r\nThis revision has a new and improved Network Option.  It lets you do all the net levels that allow race choice to use any race that is compatible with the level.  \r\nFor more information regarding Malamar, visit www.geocities.com/aresmalamar\r\nThis was posted by Tyranitar"}, "119": {"title": "Ares Music.sea", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "1.10 MB", "votes": 20, "stars": 4.2, "downloads": 2923, "identifier": 119, "filepath": "Utilities/119_Ares%20Music.sea.hqx", "description": "Hurrah! No longer must you play Ares just to listen to that great music. Enclosed are the 4 main music pieces in MADHAPP format that I extracted myself. To listen to them, simply double-click on the piece you want to listen to. A recommended download, these pieces will suit whatever mood you're in!\r\nEnjoy!\r\n-Slug\r\nhttp://my.treeway.com/slugsoft"}, "117": {"title": "3d Models Obish VS Elejee", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "1.50 MB", "votes": 5, "stars": 4.2, "downloads": 1698, "identifier": 117, "filepath": "Utilities/117_3d%20Models%20Obish%20VS%20Elejee.sit", "description": "2 of the ships from the plug but only from the Obish since the Elejeetian models are more complex and each ship is about 4mb compressed. Hope this can help someone to make new ships for ares. \r\nVIPER tmq932x@tninet.se"}, "100": {"title": "starsarefire.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "2.60 MB", "votes": 27, "stars": 4.185185, "downloads": 2746, "identifier": 100, "filepath": "Scenarios/100_starsarefire.sit.bin", "description": "The Stars Are Fire-It's time for a new challenge,\r\nAre you ready?\r\nTake on the I'du'main, Angoreans, Sh'arm'en and Addundians in 15 all-new missions that will test your piloting and thinking skills like no other plugin.\r\nSkyfox-BenSEdwards@aol.com\r\n"}, "88": {"title": "ObainReversal-Alpha", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "512.00 kB", "votes": 12, "stars": 4.166665, "downloads": 2141, "identifier": 88, "filepath": "Scenarios/88_ObainReversal-Alpha.sit", "description": "Reversal and Obain Stragety - ALPHA!\r\n\r\nThese two plugs are the alpha versions of Reversal and Obain strategy, good ideas which I gave up on a while ago. I've uploaded them so that you can play what I did manage to complete. \r\n\r\nReversal pits you as the Gaitori fighting the Ishiman advance in the first six levels. Now, instead of destroying the Space Dishes, you must defend them. You will be attempting to do all the opposite things that you were doing as the Ishimans.\r\n\r\nObain - Strategy\r\nObain strategy is an attempt to create battles which can truly challenge the might of the Obish fleet from the plug Obish Vs. Elejeetian. 6 battles, all in alpha stages, some more challenging than others.\r\n\r\nPlease read the attached documents, and enjoy!\r\n\r\n-Shrout1\r\nMade Jan, 2002 - Alpha Version"}, "126": {"title": "Doomtroopers", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "2.40 MB", "votes": 6, "stars": 4.166665, "downloads": 3127, "identifier": 126, "filepath": "Utilities/126_Doomtroopers.mp3", "description": "Ares's main theme song, \"Doomtroopers Unite!\" by Nathan and Owen Lamont, here in MP3 format for your listening pleasure.  Compatible with iTunes or any other MP3 player."}, "41": {"title": "Continuation Thingy 1.0.0 ", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "377.00 kB", "votes": 22, "stars": 4.136365, "downloads": 2067, "identifier": 41, "filepath": "Scenarios/41_Continuation_Thingy_1.0.0_.sit", "description": "Well, well, it's finally done. I got tired of Ares at around the beginning of this school year, and didn't get back into it until 3/22/03. After two days' work, it's done. Bloody annoying.\r\n\r\nAnyway, this plug takes place one year after Ares ends. The UNS is in trouble and has become somewhat corrupt. You're an aspiring commander, and, with your help, the UNS manages to stabilize itself and start winning its wars.\r\n\r\n- Mag Steelglass (vertical_file@yahoo.com)"}, "14": {"title": "Ares Race Guide", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "191.00 kB", "votes": 8, "stars": 4.125, "downloads": 2576, "identifier": 14, "filepath": "Guides/14_Ares_Race_Guide.sit", "description": "Ares Race Guide has all the specs on the major races. This guide has the stats of all the ships in each race, and even some tips for Ares Internet games! It will tell you the pros and cons of all the Ares races and ships. This guide was made using DOCMaker. I hope this guide will be beneficial. Enjoy!"}, "104": {"title": "The Iron Fist.sea", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "867.00 kB", "votes": 22, "stars": 4.09091, "downloads": 2837, "identifier": 104, "filepath": "Scenarios/104_The%20Iron%20Fist.sea.hqx", "description": "Iron Fist 1.0.3: The Gaitori are at it again and it is up to an Obish Lieutenant to prevent the subjugation of his people. With additional scripting to the levels and a harder opponent, Iron Fist is a tough one. \r\n\r\nWhile their cultures have changed, their peoples have had new concerns, and their leaderships have drastically been altered, Gaitor and Obain have always been enemies. After the liberation of Earth, the Cantharan Order started losing it's grip on the Galactic East. And after a successful and bloody rebellion by the Gaitori Isolationists, Gaitor also won it's independence. However, the apple doesn't fall far from the tree, and Gaitor and Obain once again went to war against one another. Iron fist is the first all-new mission replacement plugin for Ares. Unlike most other plugins, including Ares itself, which are 'interactive novels', Iron fist has an interactive ever-deepening plot and a branching storyline with three alternate endings. My programming skills were tested to the limit so your pilot skills could also be tested, as some of these levels are more complexly and heavily scripted than those in Ares! The decision is yours, Commander, how the war will end. -Slug gajet@pacbell.net "}, "127": {"title": "Elejee", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "482.00 kB", "votes": 12, "stars": 4.083335, "downloads": 2200, "identifier": 127, "filepath": "Utilities/127_Elejee.sit", "description": "Elejee - A complimentary plug to Obain. This plug uses Fiction Software's Elejeetian ships from the plug \"Obish Vs. Elejeetian\" and allows you to play the game through with them. Created 12/28/01 Version 1.0.0 By Shrout1"}, "55": {"title": "Earths Journey 2.0 Folder", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "326.00 kB", "votes": 15, "stars": 4.0666649999999995, "downloads": 2142, "identifier": 55, "filepath": "Scenarios/55_Earths%20Journey%202.0%20Folder.hqx", "description": "Here is a Christmas gift for the Ares community. Earth's Journey Back To The Stars v 2.0 has several new and updated missions and just a bit of net play.  \r\n"}, "35": {"title": "Catharan Crusades v1", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "35.00 kB", "votes": 3, "stars": 4.0, "downloads": 1749, "identifier": 35, "filepath": "Scenarios/35_Catharan_Crusades_v1.0", "description": "Yes, the title may sound like some cool, comepletely new scenario, but alls it really is a basic with plug with a nice name.  It allows you to take the Catharan through the factory levels.  This made the game a little bit harder.  Also, it adds 1 new ship (yes, I actually made a ship).  I made this really to try to improve my plug making skills.  However, there are about four bugs, and none of them mess the game up.  I may release another version with 2 new levels and 1 semi-new level.  Enjoy!  Created by ExtremeSpeed  Contact on GR about the plug.\r\n\r\nDisclaimer:  I am not responceble for any confusion, frustration, or death caused by obsessive playing."}, "57": {"title": "Elejees Decision-Alpha", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "400.00 kB", "votes": 4, "stars": 4.0, "downloads": 1861, "identifier": 57, "filepath": "Scenarios/57_Elejees_Decision-Alpha", "description": "FINALLY, a new plug-in for Ares. It's still in alpha, but don't worry, I'll be done pretty soon. This plug uses the ships from Shrout's Elejee plug. It's still in alpha, so it has only 10 of the 20-odd missions in the final plug. It's multi-threaded (Hooray). It may have some bugs. Report any bugs to argon_lazer@hotmail.com. Enjoy! -Anonymous"}, "58": {"title": "Endurance 1.0", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "27.00 kB", "votes": 2, "stars": 4.0, "downloads": 1685, "identifier": 58, "filepath": "Scenarios/58_Endurance_1.0.sit", "description": "Endurance 1.0\r\nThis plug adds 5 levels called survival levels.  This is a new and (hopefully) original concept that I thought of.  These are levels that you can't win, you just keep fighting until you die trying to survive for as long as you can.  Then keep track of how long you survived and how many enemies you killed.  Post your records on the ares webboards and try to break other people's records.  Have fun!"}, "64": {"title": "Former Single Player Levels 1", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "26.00 kB", "votes": 3, "stars": 4.0, "downloads": 1565, "identifier": 64, "filepath": "Scenarios/64_Former_Single_Player_Levels_1.1", "description": "Yes, its 1.1.  Whats so special?  Well, it contains 2 bug fixes and 3 more scenarios: Easy Street, The Stars Have Ears, and Hornet's Nest.  I figured that a skilled player could tackle these on the net.  It also contains in the readme the known bugs that I can't fix.  If someone could only tell me how...  One fair warning.  The Mothership Connection has a HUGE bug.  Check readme for details.\r\nThanks to EVWeb (GR name) for helping me discover a few of the bugs.  Another thanks to the people who did DL it.  Contact me the same way as before, still haven't gotten a way to block all the spam mail....  Keep a look out for a version with bug fixes...it may actually appear."}, "78": {"title": "Jimmy Page Theory of Ares", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "25.00 kB", "votes": 20, "stars": 4.0, "downloads": 1992, "identifier": 78, "filepath": "Scenarios/78_Jimmy_Page_Theory_of_Ares.sit", "description": "Introducing the new and improved Jimmy Page Theory of Ares. This remake is 24 pages long and offers the most comprehensive detail known to any ares player about the strategy behind ares net play and ares solo play. This guide offers advice that is not availible in any other place. This guide is useful to masters of ares as well as newbies who seek to learn the tricks behind the success. This offers many of my very own tricks and secrets and applies my theory to virtually every aspect of the game. From vegeta's rock paper scissors theory to a practical theory that will work for any ares player.  This guide is sure to blow the doors off of any other attempted guide you may have read or even any strategy that you might have once known to be good. Once you read this, your ares play will forever be affected with a touch of skill that will turn every game into a sure win.  As I leave Ares net play, I leave behind me my strategies for success. -submitted by Jimmy Page, 3/9/03. This is the final release."}, "122": {"title": "aresnetportraits.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "20.00 kB", "votes": 4, "stars": 4.0, "downloads": 1957, "identifier": 122, "filepath": "Utilities/122_aresnetportraits.sit.bin", "description": "This package includes a few extra net portrait icons taken from the pictures of the races in Ares.  Now you can fly as a Salrilian while looking like one too.\r\n\r\nFrom Cymltaneous Solutions -- http://cymlsol.cyml.cjb.net"}, "130": {"title": "Humans", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "213.00 kB", "votes": 3, "stars": 4.0, "downloads": 2162, "identifier": 130, "filepath": "Utilities/130_Humans", "description": "This is a small plug that just makes it so that you use the humans throughout the game, as opposed to the Ishiman being used for most of it. I didn't bother to change the briefings, and I made this as a request on the boards.\r\n- Mag Steelglass (vertical_file@yahoo.com)"}, "135": {"title": "Obain", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "482.00 kB", "votes": 8, "stars": 4.0, "downloads": 2296, "identifier": 135, "filepath": "Utilities/135_Obain.sit", "description": "Obain - Allows you to play through the game using ships from Fiction Software's \"Obish vs. Elejeetian\" plug. Created 12/2/01 by Shrout1. Version 1.0.0"}, "81": {"title": "Malamar .sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.40 MB", "votes": 20, "stars": 3.95, "downloads": 2664, "identifier": 81, "filepath": "Scenarios/81_Malamar_.sit.hqx", "description": "I am posting this file as a sort of test and preview of Beyond Reversal.  It allows you to take the Malamar ships through all of the standard Ares missions, just like many of Chris Shrouts plugs.  Anyway, I hope you like it.  It doesn't have any of the briefings changed, but it does have a short commentary that tells the story of the Malamar, and also give detailed information about the ships.  I will not release any similar plugs until after Beyond Reversal is complete.  There are 2 more new races that you will encounter in Beyond Reversal. Tyranitar"}, "99": {"title": "STARES.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.40 MB", "votes": 17, "stars": 3.941175, "downloads": 3166, "identifier": 99, "filepath": "Scenarios/99_STARES.sit.hqx", "description": "Star Trek: Ares puts you in the fight to save a small race from Dominion occupation. You will get to fly Federation Starships and realistic Star Trek weaponry through out 13 levels of Star Trek fun. "}, "107": {"title": "TheSequel", "category": "Scenarios", "author": "Anonymous", "date": "08/29/2004", "size": "2.90 MB", "votes": 16, "stars": 3.9375, "downloads": 2093, "identifier": 107, "filepath": "Scenarios/107_TheSequel.sit", "description": "As the name implies, this is a seqel. More specifically, it is a sequel to Continuation Thingy and is, in my opinion, quite a lot better. There are nine complete races whose ships are pretty much all-new (though related to the original Ares ships to varying degrees). Plotwise, the player begins as a fighter pilot for the pitifully weak Rimshot Rebellion, though they keep being promoted until they're a commodore for the last few missions. - Mag Steelglass (vertical_file@yahoo.com)"}, "76": {"title": "ItsWar v1.03.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "3.20 MB", "votes": 23, "stars": 3.9130450000000003, "downloads": 1467, "identifier": 76, "filepath": "Scenarios/76_ItsWar%20v1.03.sit.Bin", "description": "Its War (Part 1). A sequel to The Audemedon Crisis. - A Multi-threaded single player scenario. The Audemedon Axis have invaded. You're not dealing with Cantharian softies this time, the real boys are comming out to play... In a classic pincer movement, they attempt to encircle and cut off the Earth-Pionii pocket as a prelude to crushing the Humans once and for all. Just when you thought it was safe to retire to that safe little condo on Proxima ll, humanity needs you again to save it from the horrible alien hoards...\r\nThere should be no bugs in this plug. It has been tested to destruction and beyond!\r\nComments, suggestions etc welcome: lcanic@eircom.net or on the web board."}, "70": {"title": "Humans Revenge Part 1", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "83.00 kB", "votes": 6, "stars": 3.8333350000000004, "downloads": 1885, "identifier": 70, "filepath": "Scenarios/70_Humans_Revenge_Part_1.sea", "description": "Human's Revenge Part 1 finally released. This contanins 11 levels, with part 2 (and 11 more levels) yet to come."}, "101": {"title": "Survival", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "64.00 kB", "votes": 10, "stars": 3.8, "downloads": 2168, "identifier": 101, "filepath": "Scenarios/101_Survival.sit", "description": "Survival - Are you ready for the challenge? 7 missions, one goal: To survive. The first mission is extremely easy, but they get progressively harder. This plug-in is not recommended for rookies/people who get easily frustrated. Enjoy!"}, "77": {"title": "ItsWarPart2v1o6.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.50 MB", "votes": 12, "stars": 3.75, "downloads": 2039, "identifier": 77, "filepath": "Scenarios/77_ItsWarPart2v1o6.sit.Bin", "description": "It's War Part2 (v1.0.6)\r\nFighting the Green Menace!\r\nYour mission... Continuing to defend Allied Space against invasion, and leading elite Terran and Piioni forces into battle against the Cantharian Order in a fight to the finish. Finally take the battle far into the heart of Cantharian Space...\r\nWin or Lose, take command fleets of powerful new ships armed with nasty new weapons. Take on the full might of the Cantharian Starfleet, and decide whether it is they or Earth which faces twilight...\r\nCompressed with Stuffit 6.0\r\nPosted by Lord commander Anic\r\nEnjoy :)"}, "91": {"title": "Pirates.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "76.00 kB", "votes": 4, "stars": 3.75, "downloads": 1616, "identifier": 91, "filepath": "Scenarios/91_Pirates.sit.hqx", "description": "Ever wanted a pirate in your levels? Now you can have one. This plug contains all the data you need, instructions are included. Submitted by Agent_Vast. Graphics by Skyfox. \r\n"}, "44": {"title": "CvAFolder.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "91.00 kB", "votes": 3, "stars": 3.6666649999999996, "downloads": 1630, "identifier": 44, "filepath": "Scenarios/44_CvAFolder.sit.hqx", "description": "This plugin adds four new net only levels. I guess you could call this my summer break gift to the Ares community.\r\n\r\n--Brookeview"}, "56": {"title": "Earths Journey.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "109.00 kB", "votes": 15, "stars": 3.6666649999999996, "downloads": 1475, "identifier": 56, "filepath": "Scenarios/56_Earths%20Journey.sit.hqx", "description": "Earth's Journey Back To The Stars.  v 1.0.0 7/27/01\r\nby Brookeview\r\nbrookeview2@mac.com\r\nEarth's Journey continues and finishes the Ares story line in 13 new exciting and sometimes difficult missions."}, "92": {"title": "Reversal 1.1.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "51.00 kB", "votes": 12, "stars": 3.6666649999999996, "downloads": 1874, "identifier": 92, "filepath": "Scenarios/92_Reversal_1.1.sit.hqx", "description": "The original Reversal was incomplete, so we completed the rest of the missions.  We were only able to finish some of the briefings due to time constraints.  Missions that we can't get to work properly are skipped.  The final mission (Mothership Connection) has been completely recoded.  We hope you enjoy this plug.  There are no bugs in the part we coded to my knowledge.  We give the credit for both the idea and the original Reversal to Chris Shrout.  Enjoy this plug.  -Tyranitar and Phoenix  \r\nP.S. There may be a cleanup revision at a future date."}, "124": {"title": "Audemedons Attack", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "60.00 kB", "votes": 9, "stars": 3.6666649999999996, "downloads": 1502, "identifier": 124, "filepath": "Utilities/124_Audemedons%20Attack.sit", "description": "Audemedons Attack! - Allows you to play through the game as the Audemedon. Same format type as \"Those Interrupting Salrillians....\" It's nice to have superiority once in a while.\r\nFinished 11/22/01, By Shrout1, Version 1.0.0"}, "24": {"title": "Ares 1.5 .sit", "category": "Scenarios", "author": "Anonymous", "date": "04/19/2008", "size": "104.00 kB", "votes": 3, "stars": 3.6666649999999996, "downloads": 1679, "identifier": 24, "filepath": "Scenarios/24_Ares_1.5_.sit.hqx", "description": "Here it is, my third plug-in. It puts Mag Steelglass' UNS Rogue and the Nova into the original story of Ares. Other than that, nothing else is changed. Well, almost nothing. Download and read the ReadMe for more info. Comments, suggestions, money, send to darthkev@gns2000.com. Enjoy!"}, "136": {"title": "ObishVSElejeetian", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "736.00 kB", "votes": 14, "stars": 3.642855, "downloads": 2119, "identifier": 136, "filepath": "Utilities/136_ObishVSElejeetian.sit", "description": "This is the ships from the plug Obish VS Elejeetian                                                                  \r\n                                                                                                    "}, "53": {"title": "Duel", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "19.00 kB", "votes": 7, "stars": 3.5714300000000003, "downloads": 2014, "identifier": 53, "filepath": "Scenarios/53_Duel.sit", "description": "Duel!\r\nHone your skills at one-on-one dogfighting with Duel. This is a single player version of the Spaze Warz net scenario with many different ships.\r\n\r\nThe flak drones have been removed to eliminate computer player suicide.\r\nBy Shrout1 Jan 2002. Vers 1.0.0"}, "31": {"title": "Battlecruisers", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "423.00 kB", "votes": 11, "stars": 3.5454549999999996, "downloads": 1959, "identifier": 31, "filepath": "Scenarios/31_Battlecruisers.bin", "description": "This plug features a new class of ships -- battlecruisers. This is kinda crappy, it's my first plug, so it might have bugs. Well, here goes anyway...\r\n\r\nContact me at jerome_li@hotmail.com\r\n--Blood Eagle"}, "39": {"title": "Colliseum", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "21.00 kB", "votes": 2, "stars": 3.5, "downloads": 1681, "identifier": 39, "filepath": "Scenarios/39_Colliseum.sit", "description": "This is my first Ares Net Scenario, and I made it as a result of numerous requests to make a larger selection of ships of Space Warz. I orginally thought of making just a cruiser combat scenario, but i had so mush fun with it that i decided to make more ship types to battle with. This is the end result."}, "79": {"title": "magladder.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "21.00 kB", "votes": 2, "stars": 3.5, "downloads": 1777, "identifier": 79, "filepath": "Scenarios/79_magladder.sit.tgz", "description": "Macintosh Gaming League Ladder Scenarios - these are the official addon net levels for the MaG Ares ladder. Usable in all tournaments and ladder games unless otherwise stated. www.magleague.net for account signups, http://www.magleague.net/bbs2/tourney_cp.php?action=status for tournament signups. -Patrick"}, "115": {"title": "WhiteVersusWhite.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "20.00 kB", "votes": 4, "stars": 3.5, "downloads": 1833, "identifier": 115, "filepath": "Scenarios/115_WhiteVersusWhite.sit.bin", "description": "  I am Commander Yosho.  Welcome to my first Ares Scenario.  Except for Level 4, you are commanding human ships to fight the Gaitori.  The difficulty ranges from easy to moderate.  There are only a few new craft, exposed in the final level (number 7), but otherwise it will be new takes on the original ships and levels.  Thank you for your interest, and good luck.  P.S.  This is a beta version (0.5.0), it might have a few bugs."}, "123": {"title": "AresPicts", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "436.00 kB", "votes": 2, "stars": 3.5, "downloads": 1934, "identifier": 123, "filepath": "Utilities/123_AresPicts.sit", "description": "A little while in the making (due to many, many technical problems) Finally......\r\nThese are a compilation of the various Ares briefing picts, put together into larger, single picts. I designed it with Ambrosia's Eclipse Screensaver in mind - it looks wonderful as a screensaver. Created December 2001.\r\n\r\nEnjoy!\r\n\r\n-Shrout1"}, "139": {"title": "Strata Exports.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "2.70 MB", "votes": 8, "stars": 3.5, "downloads": 2771, "identifier": 139, "filepath": "Utilities/139_Strata%20Exports.sit.hqx", "description": "Strata Exports is a file containing all of the Slugsoft-rerendered ares ships I could dig up. If you use these Strara 3D files in a plugin or project, please give credit to me!\r\n-Slug\r\ngajet@pacbell.net http://my.treeway.com/slugsoft"}, "30": {"title": "Babylon five .sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "15.00 MB", "votes": 41, "stars": 3.4878050000000003, "downloads": 3724, "identifier": 30, "filepath": "Scenarios/30_Babylon_five_.sit.hqx", "description": "Yeeaaay. At last a plug with movies, sounds, missions, ships, weapons and even a splashscreen. It's kinda the first release and as such is gonna have bugs, and room for improvement. So do your best to find a fault and suggest improvements..."}, "131": {"title": "movies.sea", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "4.90 MB", "votes": 9, "stars": 3.4444450000000004, "downloads": 2929, "identifier": 131, "filepath": "Utilities/131_movies.sea.hqx", "description": "The Ares Movies. This file is for those people who downloaded Ares 1.2§ and want to see the movies without downloading the full version. To get Ares to use these, simply drag all 3 of them into your Ares Data folder."}, "69": {"title": "HR Preview Installer", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "531.00 kB", "votes": 8, "stars": 3.375, "downloads": 1381, "identifier": 69, "filepath": "Scenarios/69_HR%20Preview%20Installer.bin", "description": "Preview for the upcoming plug, \"Human's Revenge\". Contains 7 out of the 22 levels in the final version. Please post comments, suggestions, or bug reports on the boards. -Macintosh Man"}, "94": {"title": "SETR Multiplayer Lite.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "2.90 MB", "votes": 16, "stars": 3.375, "downloads": 2484, "identifier": 94, "filepath": "Scenarios/94_SETR%20Multiplayer%20Lite.sit.hqx", "description": "Well, here it is.  Finally.  After about a year of work I've taken some time off to compile 4 really good net scenarios that will help to show of some of SETR's finer aspects.  It includes the 2 main races of my TC, the Earth-Sol Federation (ESF) and Union of Worlds.  Unfortunately the Naarad could not be included, but will be and 4 more races when I finish SETR.  Anyway, may your lives be lasting and your fusion rockets burn brightly! - Count Altair El Alemein (Joveia on gr) email at countaltair@yahoo.com.au"}, "42": {"title": "Crazy Net Scenarios", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "175.00 kB", "votes": 6, "stars": 3.3333350000000004, "downloads": 1448, "identifier": 42, "filepath": "Scenarios/42_Crazy%20Net%20Scenarios.sit", "description": "Crazy Net Scenarios! is my third plug for the Ares Community. I have made seven fun, challenging scenarios, such as the Ring of Fire, Dominion, and more! This features one new race. Send any bug reports or comments to jerome_li@hotmail.com.  -Blood Eagle"}, "133": {"title": "NewShips.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "140.00 kB", "votes": 13, "stars": 3.2307699999999997, "downloads": 2750, "identifier": 133, "filepath": "Utilities/133_NewShips.sit.hqx", "description": "Compiled within is the 'blueprint' for the new ships I included in my plugin, Ishiman Quest.  This includes the Sol Federation fighter, bomber, frigate and cruiser, in Photoshop format, and ready to be put into Hera.  All these ships may be used at the downloader's disgression, excepting that I must be given acknowledgement.  -Captain Calculas"}, "17": {"title": "canthguide", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "75.00 kB", "votes": 9, "stars": 3.22222, "downloads": 2719, "identifier": 17, "filepath": "Guides/17_canthguide.sea", "description": "This is a guide that has descriptions, specs, and pictures of all of the Cantharan ships and weapons. It is in an eDoc self reading document format. Expect to see the Salrilian document soon. - Macintosh Man"}, "45": {"title": "CvIFolder.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "93.00 kB", "votes": 5, "stars": 3.2, "downloads": 1935, "identifier": 45, "filepath": "Scenarios/45_CvIFolder.sit.hqx", "description": "This plugin adds four new net only levels. I guess you could call this my summer break gift to the Ares community... This is version 1.01 and fixes level 3 \"EVAT Assault \" and makes the gateship in level one more balanced. "}, "82": {"title": "Mission-Impossible.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "703.00 kB", "votes": 5, "stars": 3.2, "downloads": 1851, "identifier": 82, "filepath": "Scenarios/82_Mission-Impossible.sit.Bin", "description": "Piloting skills wanted. Here are a few hard levels i cooked up. I made these because i was kinda board. Good luck and enjoy!\r\nSkyfox-BenSEdwards@aol.com"}, "61": {"title": "Fighter Haven 1.0.0 ", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "181.00 kB", "votes": 12, "stars": 3.166665, "downloads": 1560, "identifier": 61, "filepath": "Scenarios/61_Fighter%20Haven%201.0.0%20.sit", "description": "This is a funky, unusual plug that I didn't origionally intend to submit. But recently, I decided that it was pretty good, and the new multiplayer option is very fun, so I'm submitting it. As the name implies, fighters can survive quite decently in this plug, and are deadly in groups. All of the ships in it have been modified or are new, and interact quite well. There isn't really any way to describe it well, except that it's funky and the map is pretty small. - Mag Steelglass (vertical_file@yahoo.com)"}, "15": {"title": "AresGuideFiles.sit", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "917.00 kB", "votes": 7, "stars": 3.142855, "downloads": 4586, "identifier": 15, "filepath": "Guides/15_AresGuideFiles.sit.hqx", "description": "This is a set of files providing detailed statistics on most of the ships, weapons, and other objects in Ares.  It also includes detailed data on the entire game including some of my own observations.\r\n"}, "27": {"title": "Ascender.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "32.00 kB", "votes": 2, "stars": 3.0, "downloads": 1530, "identifier": 27, "filepath": "Scenarios/27_Ascender.sit.hqx", "description": "Firstly I'd just like to say that this description isn't exactly going to persuade people do download this scenario, but I'm no good at this sort of writing, so please dwonload it so you can see what it's like. Anyway, this is the first thing I've ever submitted, and it's not complete, but the levels are mainly completed, so I thought I'd submit it to see whether it would be worth continuing it. Basically, it is a scenario in which you play as one of two ships doing various things, depending on the mission. If you can think of a better name for it please e-mail me as I don't really like the name but I can't think of anything else."}, "36": {"title": "Challenger.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "250.00 kB", "votes": 9, "stars": 3.0, "downloads": 1803, "identifier": 36, "filepath": "Scenarios/36_Challenger.sit.hqx", "description": "Challenger is Destiny Plug's first Ares scenario. It basically makes every level much more challenging. For example, in Assasin, the Cantharans have an established base and are building ships, while you have to make do with your assult fleet. The longer you wait to strike, the more ships you'll be up against. And they also have a Heavy Destroyer escorting each carrier. In addition to those kind of things, some enemy ships have been enhanced. For example, the Gatori Carrier now has a Duel Atomic pulse launcher instead of a Conculsive Missle launcher. This scenario will offer new challenges to even the most seasoned veterans. I have extensivly tested this, and I've never beat Make Way, And It Feels So Good, or The Mothership Connection(the versions in this one), and I've only beat Hornet's Nest twice. "}, "60": {"title": "EVNet", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.50 MB", "votes": 46, "stars": 2.913045, "downloads": 2108, "identifier": 60, "filepath": "Scenarios/60_EVNet.sit", "description": "Prepare to face off with your friends as never before, with the classic ships from the hit game EV.  Six net levels, fully remade and to scale ships, faithfully ported stats, three governments, and of course through the Ares engine net play.\r\n\r\n- Lethe Cydonia\r\n- A Bold Move\r\n- Chaos Hour\r\n- Fusion\r\n- Font Lines\r\n- Fighter Duel\r\n\r\n- KMQ\r\n- http://welcome.to/ISDesign/"}, "93": {"title": "Scenario Contest", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "130.00 kB", "votes": 9, "stars": 2.88889, "downloads": 1446, "identifier": 93, "filepath": "Scenarios/93_Scenario%20Contest.hqx", "description": "This is my entry for spacecowboy's contest. You play as the Cantharan fighting off your enemies. It also includes one new ship. Have Fun!"}, "34": {"title": "Blackseas1.0.0.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.40 MB", "votes": 38, "stars": 2.8157900000000002, "downloads": 3318, "identifier": 34, "filepath": "Scenarios/34_Blackseas1.0.0.sit.bin", "description": "What if the Dark Ages never took Place? What if mankind advanced enough to make transwarp technology? What if they were able to fight back when the Gatori and Cantharan came to take Earth? With new ships, weapons, 1 new race and a new story Black seas is a great plug. By Admiral Devo (Jumpingbeans40@yahoo.co.uk) This bug-fixing update was created by Patrick(gbcdoj@mediaone.net). This fixes lots of the bugs: All 15 levels can now be accessed. The White Knight no longer causes a crash. Asteriods no longer glow when hit. Beating levels takes you to the next one."}, "20": {"title": "Jimmy Page Theory of Ares", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "7.40 kB", "votes": 9, "stars": 2.77778, "downloads": 1587, "identifier": 20, "filepath": "Guides/20_Jimmy%20Page%20Theory%20of%20Ares.sit", "description": "It's a modified version of the original rock paper scissors theory of ares, put into my own practical theory for use in ares multiplay. Get it or don't get it, but if you don't get it and keep getting killed, then it's your problem."}, "118": {"title": "Ares Cheat", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "1.90 MB", "votes": 9, "stars": 2.77778, "downloads": 2381, "identifier": 118, "filepath": "Utilities/118_Ares%20Cheat.sea", "description": "Wow! Who saw this coming?\r\n\r\nThis is my fourth Plugin for the Ares Community, except this one is for the new Ares 1.2. Basically, this is a cheat plug. All it does is change most of the levels so both sides can build carriers, Heavy Destroyers, etc. I was bored so that's why I built this plug (also, I badly need the experience with Hera). \r\n\r\n-Slug\r\ngajet@pacbell.net\r\nhttp://my.treeway.com/slugsoft"}, "54": {"title": "EarthQuest Resubmitted.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "986.00 kB", "votes": 32, "stars": 2.75, "downloads": 3625, "identifier": 54, "filepath": "Scenarios/54_EarthQuest_Resubmitted.sit.hqx", "description": "This is the resubmitted Earth Quest preview. For those of you who downloaded the original, Earth Quest resubmitted adds to the previous experience, with 3 more levels taken out of my own upcoming plugin, Star's End: The Raiders. Battle the possession of the trade routes with the pirates, thwart the corruption of the ESF and even take the battle to the dark realm of the Union itself with totally new ships, totally new sounds, totally new levels and do it with a totally new style of gameplay. - Count Altair El Alemein aka Captain Calculas @ Countaltair@yahoo.com"}, "74": {"title": "Ishiman v Ishiman", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "16.00 kB", "votes": 4, "stars": 2.75, "downloads": 1459, "identifier": 74, "filepath": "Scenarios/74_Ishiman%20v%20Ishiman.sit", "description": "This is an Ishiman versus Ishiman net level.\r\nIt requires Ares 1.2.0 to play it.\r\nThe planets are very close to each other and you can only build fighters, schooners and transports. You start in a Heavy Crusier."}, "75": {"title": "IshimanVsGaitori", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "16.00 kB", "votes": 4, "stars": 2.75, "downloads": 1654, "identifier": 75, "filepath": "Scenarios/75_IshimanVsGaitori.bin", "description": "MY first ares plugin, that I made for netplay, adds one net level, that will keep you playing until your modem fries!  Have fun! \r\n"}, "112": {"title": "Vengeance 1.0", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "146.00 kB", "votes": 12, "stars": 2.75, "downloads": 2425, "identifier": 112, "filepath": "Scenarios/112_Vengeance_1.0.0_", "description": "Vengeance 1.0.0 - Ares RPG plugin. Travel between the worlds of Ares on your quest for revenge against your former Cantharan slavemaster. Tons of systems and secret levels to explore! Created by Mag Steelglass"}, "19": {"title": "gaitoriguide", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "72.00 kB", "votes": 11, "stars": 2.7272749999999997, "downloads": 2438, "identifier": 19, "filepath": "Guides/19_gaitoriguide.sea", "description": "This is a guide that has descriptions, specs, and pictures of all of the Gaitori ships and their weapons. This document is in a eDoc self reading document format. The rest of the species will be coming soon - Macintosh Man"}, "73": {"title": "Ishiman Quest", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "163.00 kB", "votes": 22, "stars": 2.7272749999999997, "downloads": 1746, "identifier": 73, "filepath": "Scenarios/73_Ishiman%20Quest.sit", "description": "When the Sol Federation sent three of it's Expeditionary Forces to help the Argeisian Empire, one never made it.  Riding on the wings of new and unproven Sub-Etheric Transits, the 3rd Expeditionary Force was presumed lost forever.  Only a full 2 thousand years later was the truth of what happened to them discovered."}, "103": {"title": "The Audemedon Crisis v1.0.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "30.00 kB", "votes": 17, "stars": 2.70588, "downloads": 1378, "identifier": 103, "filepath": "Scenarios/103_The%20Audemedon%20Crisis%20v1.0.sit.", "description": " This is the final version of The Audemedon Crisis Part 1. It has five relatively simple levels.I have re-jigged things so that the computer is a little less stupid in the way in which it deploys its forces..., this is with due regard to the fact that the levels have to be actually beatable."}, "90": {"title": "Obish VS Elejeetian Folder", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.20 MB", "votes": 38, "stars": 2.657895, "downloads": 2639, "identifier": 90, "filepath": "Scenarios/90_Obish%20VS%20Elejeetian%20Folder.hqx", "description": "This plug enables you to play as either as the Obish and the Elejeetain with loads of new sprites for each race! This Plug is part of an upcoming mod by Viper called The Space: Rules of War. Enjoy! (Zell and Viper) the.dillons@btnternet.com"}, "110": {"title": "UEICTP.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "316.00 kB", "votes": 25, "stars": 2.6, "downloads": 2562, "identifier": 110, "filepath": "Scenarios/110_UEICTP.sit.hqx", "description": "The United Earth Interplanetary Combat Training Program is a set of 5 unrelated single-player missions I made. They are quite playable, well-tested, and include a couple of new ships. Also included is a teaser for my upcoming major plugin, Black Hole.\r\n - Gul Banana"}, "105": {"title": "The Rogue", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "394.00 kB", "votes": 17, "stars": 2.588235, "downloads": 1692, "identifier": 105, "filepath": "Scenarios/105_The%20Rogue.sit", "description": "The UNS Rouge was launched one year after the Apollo 2200. This is version 1.0.4, and several other bugs and grammer errors,              etc., have been fixed. I've also added a bonus level, for those of you who can find it! - Mag Steelglass \r\n"}, "16": {"title": "AresStrategyGuide.sea", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "521.00 kB", "votes": 28, "stars": 2.5714300000000003, "downloads": 3335, "identifier": 16, "filepath": "Guides/16_AresStrategyGuide.sea.bin", "description": "Ever had problems beating those really hard levels? Ever thought that it doesnÕt seem right for Gatori Cruisers to beat Ishima Heavy Destroyers? Well now no more! Ares Strategy Guide is for those of you who just canÕt seem to beat certain levels. This guide can be especially useful if you are new to Ares. Ares Strategy Guide has strategies for every level. They are simple, and easy to read and use. This guide also includes tips for certain situations. I will eventually make another Ares Strategy guide, with more tips and better strategies. Just e-mail me if you have one. This guide was made using DocMaker. Enjoy the guide! - Captain Carnotaur\r\ncdp@pautsch.com"}, "33": {"title": "bigblobing.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "29.00 kB", "votes": 17, "stars": 2.52941, "downloads": 1813, "identifier": 33, "filepath": "Scenarios/33_bigblobing.sit.Bin", "description": "This is big blobing a plug useing my ships from Alpha to omega its one plug in with infinet kills!\r\nThis is big blobing a plug useing my ships from Alpha to omega its one plug in with infinet kills!\r\nEMINEM"}, "106": {"title": "TheMijees.sit", "category": "Scenarios", "author": "Anonymous", "date": "07/19/2008", "size": "408.00 kB", "votes": 4, "stars": 2.5, "downloads": 1565, "identifier": 106, "filepath": "Scenarios/106_TheMijees.sit.bin", "description": "My levels are basically about a new race that the humans found called the Mijees that are on the brink of extinction by, of course, the Audomedons. There are 12 levels. The first 11 are easy but the twelfth one will really surprise you. I did something that I'm not even sure Nathan Lamont thought of so I wont tell you what it is. You'll have to find out yourself. I would like you to read the \"READ ME FIRST!!!\" file highlighted in yellow. It has some important information about the file. Thanks!!!  :-)"}, "138": {"title": "Salrilians", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "174.00 kB", "votes": 34, "stars": 2.47059, "downloads": 4624, "identifier": 138, "filepath": "Utilities/138_Salrilians.sea", "description": "A while ago, someone asked me to make a plugin where the player can go through the game as a Salrilian. Well, after three days of work, here is the plugin! All of the missions are the same, but the player can now build and pilot Salrilian vessels. I have played it my self several times to ensure that it is playable (though a bit buggy due to the current version of Hera). You need Ares 1.2 and Hera to play this file. \r\n\r\nAlso, instead of a Ishiman interface (like in normal Ares) this plugin gives you a sleek Salrilian interface and a new title screen. I hops you have fun with this (my second Ares 1.2 plugin).\r\n\r\n-Slug\r\ngajet@pacbell.net\r\nhttp://my.treeway.com/slugsoft"}, "37": {"title": "Challenger101.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "249.00 kB", "votes": 7, "stars": 2.4285699999999997, "downloads": 1866, "identifier": 37, "filepath": "Scenarios/37_Challenger101.sit.hqx", "description": "This is version 1.0.1 of Challenger. Not much is new in this release and normally I would hold it until I had more, but there were some pretty serious bugs in version 1.0.0. I can now guarentee that it works up to Make Way, and only because I can't beat this version of Make Way. So here it is, and expect another version soon.\r\n\r\nChallenger is Destiny Plug's first Ares scenario. It basically makes every level much more challenging. For example, in Assasin, the Cantharans have an established base and are building ships, while you have to make do with your assult fleet. The longer you wait to strike, the more ships you'll be up against. And they also have a Heavy Destroyer escorting each carrier. In addition to those kind of things, some enemy ships have been enhanced. For example, the Gatori Carrier now has a Duel Atomic pulse launcher instead of a Conculsive Missle launcher. This scenario will offer new challenges to even the most seasoned veterans. I have extensivly tested this, and I've never beat Make Way, And It Feels So Good, or The Mothership Connection(the versions in this one), and I've only beat Hornet's Nest twice. "}, "32": {"title": "Battlestations", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "14.00 kB", "votes": 10, "stars": 2.4, "downloads": 2275, "identifier": 32, "filepath": "Scenarios/32_Battlestations.Bin", "description": "Two motherships, capable of building attack and defense craft. The object of the game is to destroy your opponents mothership (Network only).\r\n"}, "116": {"title": "WOTFPreview.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.30 MB", "votes": 18, "stars": 2.38889, "downloads": 2032, "identifier": 116, "filepath": "Scenarios/116_WOTFPreview.sit.bin", "description": "Wrath Of The Fallen Preview: This is a preview of my upcoming TC for Ares. It includes the first five levels. Join the ranks of the Triplanetary Confederation's finest as they struggle to fight back against the evil Sol Empire. -Patrick Cavanaugh( gbcdoj@mediaone.net )"}, "96": {"title": "Space Marines NET.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "20.00 kB", "votes": 24, "stars": 2.375, "downloads": 1456, "identifier": 96, "filepath": "Scenarios/96_Space%20Marines%20NET.sit.bin", "description": "A fun level where you use Space Marines instead of ships.\r\nThis is the NET level. Made By Daniel Haskins"}, "72": {"title": "Ishiman Overkill Mod.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "42.00 kB", "votes": 11, "stars": 2.363635, "downloads": 1814, "identifier": 72, "filepath": "Scenarios/72_Ishiman%20Overkill%20Mod.sit.hqx", "description": "Basically this Mod makes all the Ishiman ships dead powerful and adds a variety to hte weapons of the Ishiman ships.If you continously get stuck on the single player or are lokign to spice up your internet games then this is the Mod for you.\r\n\r\nZell (zellkickass@hotmail.com)"}, "23": {"title": "Aftermath1.2.0.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "649.00 kB", "votes": 32, "stars": 2.34375, "downloads": 2837, "identifier": 23, "filepath": "Scenarios/23_Aftermath1.2.0.sit.bin", "description": "The Aftermath 1.2 By Patrick (email: gbcdoj@mediaone.net)\r\nThe Aftermath picks up where Ares left off. It has 8 new levels and 1 new ship with a new sprite."}, "66": {"title": "Gate ships.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "95.00 kB", "votes": 9, "stars": 2.333335, "downloads": 1422, "identifier": 66, "filepath": "Scenarios/66_Gate%20ships.sit.hqx", "description": "This mod adds the Ishiman Gate ship and a new net level \"Showdown at Noon (No Pistols)\" where two gateships duke it out for the cosmos.Goes well with Ishiman and Human Overkill.Zell (zellkickass@hotmail.com)"}, "129": {"title": "fbwn.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "77.00 kB", "votes": 24, "stars": 2.333335, "downloads": 2096, "identifier": 129, "filepath": "Utilities/129_fbwn.sit.hqx", "description": "The Final Battle- The Way it Was Supposed to Be.\r\n\r\nFor reasons unknown to me, the distribution version of the Ares stock scenario does not use an effect that was apparently intended for the death of the final death of the Cantharan Gate Ship.  This scenario provides a modification that reinstates this effect, and the last level of the game.  - KMQ"}, "85": {"title": "Netz Gamez.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "111.00 kB", "votes": 25, "stars": 2.32, "downloads": 1464, "identifier": 85, "filepath": "Scenarios/85_Netz%20Gamez.sit.hqx", "description": "Netz Gamez is a collection of four unique and new multiplayer levels for Ares. Whether you're in the mood to combine forces against a computer opponent or duke it out over an entire galaxy, Netz Gamez will fit the occasion. Enjoy!   -Slug,  Axis Software Integrated  \r\n"}, "140": {"title": "SWA", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "3.00 MB", "votes": 27, "stars": 2.2962949999999998, "downloads": 3394, "identifier": 140, "filepath": "Utilities/140_SWA.sea", "description": "Screwing With Ares\r\n\r\nThis is my second addon for the Ares Community. Anyways, this set of data files allows you to see the ships you were never meant to see, such as the Ishiman Schooner, the Audemedon Battlecruiser, the Ishiman Escort, etc. Basically, I was just bored so that's why I made this. Enjoy piloting these new ships!\r\n\r\n-Slug\r\ngajet@pacbell.net\r\nhttp://my.treeway.com/Slugsoft"}, "97": {"title": "Space Marines.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "20.00 kB", "votes": 24, "stars": 2.291665, "downloads": 1452, "identifier": 97, "filepath": "Scenarios/97_Space%20Marines.sit.bin", "description": "This is a fun game where you use Space Marines instead of\r\nships! This is the Single Player Version of Space Marines!\r\nHave Fun!\r\n\r\nMap Made By Daniel Haskins"}, "22": {"title": "Aaaagh", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "271.00 kB", "votes": 18, "stars": 2.27778, "downloads": 2102, "identifier": 22, "filepath": "Scenarios/22_Aaaagh.hqx", "description": "This plug replaces all Ishiman ships with Gaitori ships, and makes it so that when you can build Human ships, you can still only build Gaitori ships. This isn't meant to be a huge, super-duper plug. It's just a little thing, to provide people with a little more challenge than Ares normally provides (don't worry, it's still possible to beat the game). - Mag Steelglass (this new version fixes a couple bugs I found)"}, "29": {"title": "AudemedonBattles", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "83.00 kB", "votes": 16, "stars": 2.25, "downloads": 2211, "identifier": 29, "filepath": "Scenarios/29_AudemedonBattles.hqx", "description": "This plugin contains three levels set in a time after the original game.  It is based around a new Audemedon Battleship.  It is about twice as hard to kill as the carrier. Some ships have little upgrades or changes to make it interesting.  I hope you enjoy playing it. E-mail: deranger@bungie.net ."}, "67": {"title": "GundamWingPlusSingle", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "58.00 kB", "votes": 24, "stars": 2.25, "downloads": 3263, "identifier": 67, "filepath": "Scenarios/67_GundamWingPlusSingle.sit", "description": "Gundam Wing Plus (Single) Ver. 1.0.0 contains: 4 new single player levels,\r\n and a couple new races, plus its even more realistic."}, "102": {"title": "template", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "573.00 kB", "votes": 4, "stars": 2.25, "downloads": 1695, "identifier": 102, "filepath": "Scenarios/102_template.sit", "description": "This is a file which may assist plug in creators.\r\nIt contains all of the Ares Objects in an empty error-free Hera File. It contains NO Scenarios. Fill those in yourself. They should be created from scratch using this file as a starter. Do not copy in scenarios, this will probably lead to corruption of the file. To transfer existing scenarios you will need to re-create them from scratch.\r\n\r\nThe file is compressed as a .sit file using version 5.1, 574K\r\nReprot any problems to me at: lca@eircom.net"}, "25": {"title": "AresNetRemix.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "28.00 kB", "votes": 11, "stars": 2.18182, "downloads": 1790, "identifier": 25, "filepath": "Scenarios/25_AresNetRemix.sit.bin", "description": "\tSix Ares net levels, including Location x 3 arguably the most strategic Ares Net Scenario now released, it will likely take more than rushing to win this match.  The classic \"...Into the Fire\" from single player now in net, The Hard Way, tight combat with nine moons in Jovian Chronicles, Scratching Post Pluss, more green asteroids, more Zerbilites, and changes to make rushing a strategy, not the ultimate choice, and more.  Also included is a -secondary- version of the level set with \"semi-fair\" across the board new weapons, and enhancements to old favorites.  Including more cloaking ships for the Salrilian, and a Gaitori Gunship that will hang back with its target ship rather than flying into the fire.  Don't forget the Audemedon, their new weapon is good for taking out fleets...but who's? - KMQ http://welcome.to/ISDesign"}, "89": {"title": "ObainvsGaitorv1.2.0.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "50.00 kB", "votes": 6, "stars": 2.166665, "downloads": 1795, "identifier": 89, "filepath": "Scenarios/89_ObainvsGaitorv1.2.0.sit.bin", "description": "This is version 1.2 of Obain versus Gaitor. The level now will end when the Gaitori fleet is destroyed"}, "43": {"title": "Cruiser vs Schooner.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "20.00 kB", "votes": 13, "stars": 2.153845, "downloads": 1434, "identifier": 43, "filepath": "Scenarios/43_Cruiser%20vs%20Schooner.sit.hqx", "description": "To put an end to the elusive 'Cruiser vs Schooner' and 'Human gunship vs Escort' argument, I have compiled together 2 net levels of the aforesaid ships - Count Altair El Alemein @ countaltair@yahoo.com.au "}, "109": {"title": "Toughlevels.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "16.00 kB", "votes": 20, "stars": 2.15, "downloads": 1985, "identifier": 109, "filepath": "Scenarios/109_Toughlevels.sit.bin", "description": "Toughlevels- These are two new very very hard single player missions.You will have to be a very good pilot to win.\r\n\t\t-Patrick"}, "86": {"title": "NewPICTs1.0.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "2.20 MB", "votes": 14, "stars": 2.142855, "downloads": 1522, "identifier": 86, "filepath": "Scenarios/86_NewPICTs1.0.sit.bin", "description": "New PICTs 1.0 changes all the Cantharan ship PICTs to Gatori ship PICTs, and vice versa. This is my first Ares plug-in. Have fun and enjoy! - Captain Carnotaur"}, "108": {"title": "TOR", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "14.00 kB", "votes": 14, "stars": 2.0714300000000003, "downloads": 1891, "identifier": 108, "filepath": "Scenarios/108_TOR.bin", "description": "The Other Races v1.0: This collection of net levels adds Elejeetian, Obish, and Bazidanese to the race selection for Rock vrs Rock, Scratching Post, as well as opening all races for Space Warz.  Also humans are added to Location, Location, Location.  It also adds a new competitive, and a new cooperative level to the level selection. - KMQ http://welcome.to/ISDesign"}, "59": {"title": "evFD.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "200.00 kB", "votes": 18, "stars": 2.055555, "downloads": 1833, "identifier": 59, "filepath": "Scenarios/59_evFD.sit.bin", "description": "BEV:Fighter Duel v1.0/B DDThis is a predecessor to the upcoming [no release date] EV:Net Ares scenario set.  This is the current well rounded v1.0 not the 0.5 that was uploaded without my knowledge by one of my beta testers.  It includes all new recreated EV ship graphics, and faithfully ported stats [such as was practical given engine differences] for Shuttle, Manta Fighter, Patrol Fighter, Hawk Fighter, Lightning Fighter, Rapier Fighter, Cliper, Defender, and Alien Fighter. BR A HREF=\"http://welcome.to/ISDesign\"welcome.to/ISDesign/ABRBR - KMQBR"}, "26": {"title": "Aressoundset.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "199.00 kB", "votes": 4, "stars": 2.0, "downloads": 2120, "identifier": 26, "filepath": "Scenarios/26_Aressoundset.sit.hqx", "description": "For sad folk like myself who can't get enough of Ares:\r\nThe Ares sound set.  Get an ares fix while doing your work.\r\nI use a FF7 sound set file and extracted the ares sounds into it.  Works great on my mac :]\r\n\r\n-Clipboard"}, "111": {"title": "UltimateNet", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "43.00 kB", "votes": 3, "stars": 2.0, "downloads": 1548, "identifier": 111, "filepath": "Scenarios/111_UltimateNet.hqx", "description": "Ultimate Net 1.0.1 this is the updated version for Ultimate Net it fixes alot of bugs that I have found it also lets you play Space Race The Musical! and fixes the levels prologue to say the chapter and name and stuff. I hope you enjoy this plug, Capt Ginew.\r\nif you have any problems email me at dustin_nabess@hotmail.com"}, "47": {"title": "D.E. Part12.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.10 MB", "votes": 3, "stars": 2.0, "downloads": 2658, "identifier": 47, "filepath": "Scenarios/47_D.E._Part12.sit.hqx", "description": "The Destructive Elejeetian:This is the part1 and 2 of Destructive Elejeetian series. It is adventure of Elejeetian. The Elejeetian made a strongest cruiser. That's name is \"Elejeetian-Cruiser\". The cruiser destroyed many spaceship. And if you use this cruiser,enemies will be destroyed. Elejeetian wants to rule the Universe,and you can help them."}, "87": {"title": "NicePlug.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "29.00 kB", "votes": 9, "stars": 1.88889, "downloads": 1501, "identifier": 87, "filepath": "Scenarios/87_NicePlug.sit.Bin", "description": "Hi this  is eminem i hope u enjoy this its  a  good netlevel   with É1level!\r\nHi this  is eminem i hope u enjoy this its  a  good netlevel   with É1level!"}, "134": {"title": "newsprites.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "1.20 MB", "votes": 15, "stars": 1.866665, "downloads": 2005, "identifier": 134, "filepath": "Utilities/134_newsprites.sit.bin", "description": "New Sprites: This is a collection of pretty much all of the sprites I've made for Ares. It includes 17 ship sprites, 1 missile sprite, and 6 briefing pictures. -Patrick email: gbcdoj@mediaone.net"}, "113": {"title": "Violent Sounds", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "2.10 MB", "votes": 12, "stars": 1.833335, "downloads": 1698, "identifier": 113, "filepath": "Scenarios/113_Violent%20Sounds.sea", "description": "Ever get bored of those old Ares sounds? Does the Cantharan Carrier sound more like a choking duck than a thing to be scared of? Do those Ishiman Fusion Pulses get on your nerves? How about that boring title music?\r\n\r\nThis is the file for you!\r\n\r\nSimply place this file in your ARES DATA folder, replace the origional, and boot up ARES. This file replaces the Music (with the music I'm planning to use in my future plugin BEFORE THEY SAILED.), the build sounds, and most of the weapon sounds with the most violent sounds I could get my slimey hands on.\r\n\r\n-Slug"}, "84": {"title": "Net Pak.sea", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "80.00 kB", "votes": 12, "stars": 1.75, "downloads": 1642, "identifier": 84, "filepath": "Scenarios/84_Net_Pak.sea.hqx", "description": "Net Pak contains 2 net games. One is called \"Money, money, and more money\" each player has a planet, a heavy desroyer, and two power stations. a flak drone resides in the middle, and there are two bunker stations. The other is called \"E M P T Y N E S S\". Each player ONLY has a Heavy destroyer. I cannot gaurentee that \"E M P T Y N E S S\" will work."}, "21": {"title": "RaceTemplate.sit", "category": "Guides", "author": "Anonymous", "date": "08/12/2004", "size": "1.80 kB", "votes": 6, "stars": 1.666665, "downloads": 2178, "identifier": 21, "filepath": "Guides/21_RaceTemplate.sit.hqx", "description": "If you're interested in getting a look at the innards of the Ares Scenarios file, here's a place to start. Just looking, you may realize that Ares' programming isn't all that different from EV/O"}, "125": {"title": "ChangeofPace.sit", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "91.00 kB", "votes": 3, "stars": 1.666665, "downloads": 2238, "identifier": 125, "filepath": "Utilities/125_ChangeofPace.sit.hqx", "description": "A set of two files.  Each changes the difficulty level of Ares.  The first, Trainee, makes all computer-controlled ships extremely stupid the second, Insane, will make all computer-controlled ships very smart and aggressive.  None of the physical specs of the ships have been changed."}, "68": {"title": "HopelessCause", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "44.00 kB", "votes": 7, "stars": 1.5714299999999999, "downloads": 2052, "identifier": 68, "filepath": "Scenarios/68_HopelessCause.sit", "description": "\tAt the end of mission 6, the Gaitori hang back, defeated, for the moment...\r\n\tThey hold on to their planet and one flak drone, and are seriously disabled...\r\n\tBut they find a new commander...\r\n\tOne who believes in the Hopeless Cause...\r\n\r\n\t10 cool new net scenarios, including the one described above. Made by Capt. Jordarrin."}, "65": {"title": "FrozenHeartNET.sea", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.60 MB", "votes": 8, "stars": 1.5, "downloads": 1691, "identifier": 65, "filepath": "Scenarios/65_FrozenHeartNET.sea.Bin", "description": "This Fixes the Bug in the Other on and it fixs alot of bugs This Fixes the Bug in the Other on and it fixs alot of bugs Sorry -EMINEM\r\n"}, "132": {"title": "New Ares Interface", "category": "Utilities", "author": "Anonymous", "date": "08/12/2004", "size": "68.00 kB", "votes": 4, "stars": 1.5, "downloads": 1361, "identifier": 132, "filepath": "Utilities/132_New%20Ares%20Interface.sit", "description": "A stylish new interface for Ares, which replaces the old main menu. ResEdit experience required for installation. -Skyfox"}, "48": {"title": "D.E. Part34.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "1.10 MB", "votes": 2, "stars": 1.5, "downloads": 2590, "identifier": 48, "filepath": "Scenarios/48_D.E._Part34.sit.hqx", "description": "The Destructive Elejeetian part3 and 4:This is an Ares scenario file,the part of Destructive Elejeetian series. In the part2,the Elejeetian ruled the Universe. So Elejeetian made a new ship. That is new Elejeetian-Cruiser. Elejeetian reconstruct the Gaitori's machin gun in Part4. You can destroy many ships by this cruiser.\r\nEnjoy!"}, "98": {"title": "SpaceRaceTheMusical.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "27.00 kB", "votes": 7, "stars": 1.4285700000000001, "downloads": 1972, "identifier": 98, "filepath": "Scenarios/98_SpaceRaceTheMusical.sit.bin", "description": "This file contains Space Race, The Musical: Network Edition. Space Race requires Ares 1.2.0B5"}, "40": {"title": "comp killer", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "15.00 kB", "votes": 14, "stars": 1.357145, "downloads": 1425, "identifier": 40, "filepath": "Scenarios/40_comp%20killer.sit", "description": "Single player versions of the standard multiplayer scenarios."}, "28": {"title": "ATWNet1.0.2.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "16.00 kB", "votes": 6, "stars": 1.166665, "downloads": 1591, "identifier": 28, "filepath": "Scenarios/28_ATWNet1.0.2.sit.bin", "description": "After The War Net Scenarios Update 2(v1.0.2) This changes the number of players in Quadworld from 1 to 3 so now it should work."}, "50": {"title": "DestructiveElejeetian.sit", "category": "Scenarios", "author": "Anonymous", "date": "09/26/2004", "size": "4.00 MB", "votes": 6, "stars": 1.166665, "downloads": 4086, "identifier": 50, "filepath": "Scenarios/50_DestructiveElejeetian.sit.hqx", "description": "Destructive Elejeetian set: It is a set containing all the scenarios of the Destructive-Elejeetian series. One scenario for the Internet and the scenario of Part1-5 for the single play mode. In these series, it deals with the adventure of Elejeetian and invigorating destruction, new arms, etc. can be enjoyed. The author is ike. I am waiting by GameRanger.    E-Mail:ike@ma.u-netsurf.jp  HomePage(Japanese):http://www.geocities.jp/ike_blackandwhite/index.html  My HomePage which can download these:http://www.geocities.jp/heavy_download/index.html"}, "46": {"title": "D.E. For Net.sit", "category": "Scenarios", "author": "Anonymous", "date": "08/12/2004", "size": "558.00 kB", "votes": 5, "stars": 1.0, "downloads": 2848, "identifier": 46, "filepath": "Scenarios/46_D.E._For_Net.sit.hqx", "description": "enormous gaping anus"}, "49": {"title": "D.E. Part5.sit", "category": "Scenarios", "author": "Anonymous", "date": "09/26/2004", "size": "607.00 kB", "votes": 4, "stars": 1.0, "downloads": 2534, "identifier": 49, "filepath": "Scenarios/49_D.E._Part5.sit.hqx", "description": "Destructive Elejeetian Part5:A new missile for Elejeetian-Cruiser. The missile is very strong and it can kill a gateship only 1 missile."}, "83": {"title": "Net Levels Galore .sit", "category": "Scenarios", "author": "Anonymous", "date": "04/05/2008", "size": "18.00 kB", "votes": 1, "stars": 1.0, "downloads": 1552, "identifier": 83, "filepath": "Scenarios/83_Net_Levels_Galore_.sit.hqx", "description": "Hello, again. Here is my second plug, 'Net Levels Galore.' It contains four net missions with no particular story, including an upgraded version of Capture the Flagpod. If you encounter problems, want to send praise or ideas for my next plug, send it to the e-mail in the ReadMe. Keep checking in for my third plug, Ares 1.5, and my fourth plug, 'Heroes of the Stars.' Until then, enjoy!"}}