{"618": {"title": "Teleporter", "category": "Miscellaneous", "author": "Anonymous", "date": "08/22/2007", "size": "12.00 kB", "votes": 1, "stars": 5.0, "downloads": 2000, "identifier": 618, "filepath": "Miscellaneous/618_Teleporter.sitx", "description": "This mage character has five sets of stairs in his inventory and was created by hacking the save file.  The top set of stairs (when used) leads to Kosha, the second to Pnyx, the third to Cademia, the fourth to Catamarca, and the fifth to Odemia."}, "619": {"title": "Tree", "category": "Miscellaneous", "author": "Anonymous", "date": "08/22/2007", "size": "12.00 kB", "votes": 3, "stars": 5.0, "downloads": 2145, "identifier": 619, "filepath": "Miscellaneous/619_Tree.sitx", "description": "This character is relatively simple: his inventory contains one set of stairs.  When you use these stairs, you will teleported to the incomplete Tree of Life region.  I suggest that you take care to avoid getting this character stuck in that region."}, "620": {"title": "Zone", "category": "Miscellaneous", "author": "Anonymous", "date": "08/22/2007", "size": "21.00 kB", "votes": 1, "stars": 5.0, "downloads": 2047, "identifier": 620, "filepath": "Miscellaneous/620_Zone.sitx", "description": "This character contains a list of Cythera zones, a screenshot, and a save file.  It is designed for use by Cythera hackers.  The character already has a flight of stairs in his inventory.  Using a hexeditor, you can design these stairs to lead to any of the listed zones."}, "615": {"title": "Pandora s Box.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "11/15/2007", "size": "326.00 kB", "votes": 3, "stars": 5.0, "downloads": 2459, "identifier": 615, "filepath": "Miscellaneous/615_Pandora_s_Box.sit.hqx", "description": "Pandora's Box v1.1!  This is an old Mac application that allows editing of Cythera saved games.  Please note that it requires Mac OS 9 or earlier and will not run natively on OS X.  It is no longer supported, nor is it owned or maintained by me.  I am uploading it as-is so that it is not completely lost. -- Uploaded by Wizard"}, "606": {"title": "CheaterSavedGame.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "11/15/2007", "size": "17.00 kB", "votes": 1, "stars": 5.0, "downloads": 1922, "identifier": 606, "filepath": "Miscellaneous/606_CheaterSavedGame.sit.hqx", "description": "This is a character named \"I.M.Cheater\" that was created using Pandora's Box.  It is a character at the very beginning of the game with 255 training points.  It was created by Benjamin Douglass (AKA Slayer).  I am merely uploading it for your convenience. -- Uploaded by Wizard"}, "610": {"title": "Cythera Music Part 2", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2008", "size": "9.30 MB", "votes": 3, "stars": 5.0, "downloads": 2101, "identifier": 610, "filepath": "Miscellaneous/610_Cythera_Music_Part_2.zip", "description": "This is part 2 of 3 in a set including all of Cythera's music, plus two bonus songs!  This package includes the music for Odemia, Catamarca, Cademia, Kosha, and Pnyx.  The music was composed by Randy Pringle I had absolutely nothing to do with its production.  Please direct questions to the Cythera Web Board. -- Uploaded by Wizard."}, "611": {"title": "Cythera Music Part 3", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2008", "size": "9.90 MB", "votes": 4, "stars": 5.0, "downloads": 2103, "identifier": 611, "filepath": "Miscellaneous/611_Cythera_Music_Part_3.zip", "description": "This is part 3 of 3 in a set including all of Cythera's music, plus two bonus songs!  This package includes the underground music, the danger theme, the Seldane theme, and two bonus tracks entitled \"Underground Remix\" and \"City of Mystery\".  The music was composed by Randy Pringle I had absolutely nothing to do with its production.  Please direct questions to the Cythera Web Board. -- Uploaded by Wizard."}, "609": {"title": "Cythera Music Part 1", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2008", "size": "9.10 MB", "votes": 5, "stars": 4.8, "downloads": 2229, "identifier": 609, "filepath": "Miscellaneous/609_Cythera_Music_Part_1.zip", "description": "This is part 1 of 3 in a set including all of Cythera's music, plus two bonus songs!  This package includes the main menu music, Cythera's overworld theme, and Land King Hall's music.  The music was composed by Randy Pringle I had absolutely nothing to do with its production.  Please direct questions to the Cythera Web Board. -- Uploaded by Wizard."}, "612": {"title": "Cytheramenupatch", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "26.00 kB", "votes": 10, "stars": 4.2, "downloads": 2452, "identifier": 612, "filepath": "Miscellaneous/612_Cytheramenupatch.sit", "description": "This small patch by Tycho Maudd enables 2 menus in Cythera, an Audio menu and a perfernces menu. The function of the Audio menu is obvious, but the preferences menu has one sepcial fucntion, it can change the frame rate. Changing the frame rate can speed up or slow down the game and can make movement/animations look better or worse. Higher FPS makes better animation. Be sure that you have Cythera version 1.0.4 before trying this patch. It is also recommended that you apply this patch to a COPY of Cythera, rather than the original, as this patch could be quite difficult to reverse.\r\n"}, "613": {"title": "Cytheramenuunpatcher", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "25.00 kB", "votes": 6, "stars": 4.0, "downloads": 2155, "identifier": 613, "filepath": "Miscellaneous/613_Cytheramenuunpatcher.sit", "description": "Hmm. I should have put this in with my Cythera Menu patch. This just removes the patch if you have already applied it and don't like it and didn't make a copy of cythera first. By Tycho Maudd"}, "614": {"title": "MagpiePumpkinPatch.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "167.00 kB", "votes": 19, "stars": 3.894735, "downloads": 3384, "identifier": 614, "filepath": "Miscellaneous/614_MagpiePumpkinPatch.sit.hqx", "description": "The first \"official\" add-on for Cythera. Harvest time comes and the leaves change, something strange is going on in Cythera...\r\n\r\nThis is a simple patch that replaces some of the graphics in Cythera, providing a seasonal change.  It includes a program to manage installing and removing patches as well.  Note that this only changes some of the graphics - no game play elements are changed."}, "617": {"title": "StairWay.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "12.00 kB", "votes": 12, "stars": 3.75, "downloads": 2383, "identifier": 617, "filepath": "Miscellaneous/617_StairWay.sit.hqx", "description": "This is the background music for Cythera when you're in LandKingHall(?)\r\nI'm submitting this after receiving a request on the Cythera Webboard.\r\nI did not make this or alter this. I got it from the old Delver site and\r\nnoticed that it is no longer here. I remember there being one more but\r\nI don't seem to be able to find it. I think it was music when you are\r\nunder LandKingHall? If someone has it will you plz send me a copy\r\nJAce21@popsmail.com. thx."}, "605": {"title": "3DCursors.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "8.60 kB", "votes": 11, "stars": 3.636365, "downloads": 2620, "identifier": 605, "filepath": "Miscellaneous/605_3DCursors.sit.hqx", "description": "\r\n3D Cursors is a small plug in for Cythera that makes the cursors look somewhat more 3 dimensional. The effect is very subtle, however, so don't expect a complete change in the cursor. Also, you will need a copy of ResEdit to install it, and mucking with ResEdit can get messy if you don't backup, so remember to. By Talos of Bacchus Freeware."}, "608": {"title": "Cythera Makeover.sea", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "2.80 MB", "votes": 8, "stars": 3.5, "downloads": 2596, "identifier": 608, "filepath": "Miscellaneous/608_Cythera_Makeover.sea.bin", "description": "From Digital Manipulation - A total make over kit for your mac. The kit includes: a kaleidoscope scheme (starring KaleidoScopie schemer - albie wong!) with a system wide icon replacement, a sound set, desktop pictures, desktop patterns, a couple of extra icons, a couple of extra system sounds and dragthing color settings!"}, "607": {"title": "Cythera ScreenSaver", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "454.00 kB", "votes": 9, "stars": 3.11111, "downloads": 1811, "identifier": 607, "filepath": "Miscellaneous/607_Cythera%20ScreenSaver.sit", "description": "A little application, stand-alone screen saver ( flying warriors moving in Cythera's landscape ) to launch when you wanna take a break. A click anywhere on the screen closes the animation. Made in France by Florence Bouhier."}, "616": {"title": "Rocky the Flying Chicken", "category": "Miscellaneous", "author": "Anonymous", "date": "10/19/2008", "size": "28.00 kB", "votes": 2, "stars": 3.0, "downloads": 1905, "identifier": 616, "filepath": "Miscellaneous/616_Rocky_the_Flying_Chicken.zip", "description": "Several people have asked for a save file with the character as a flying chicken: hence, this save file.  (Actually, I created two save files, both mages, one with the male hero and one with the female hero I have uploaded both in this file.)  In homage to Rocky and Bullwinkle, both characters are \"Rocky the Flying Chicken.\"  Both characters can kind of fly."}}