{"628": {"title": "wopr", "category": "Miscellaneous", "author": "Anonymous", "date": "05/04/2007", "size": "1.80 MB", "votes": 26, "stars": 3.7307699999999997, "downloads": 6693, "identifier": 628, "filepath": "Miscellaneous/628_wopr.zip", "description": "WOPR: The Wargames Mod - While DEFCON is inspired by the movie Wargames, it doesn't look and sound much like it...until now. The WOPR mod brings the sights and sounds of Wargame's NORAD to DEFCON, with all new units (cities, silos, sams, subs, nukes, fighters, bombers, airbases), indicators (nuke launch markers, explosions and directional arrows), GUI icons, color themes, fonts and sound effects. The only winning move is not to play - but if you must, play Wargames-style with WOPR\r\n\r\nThe WOPR Mod is brought to you by RnSK with graphics by Kai Cherry, font based on work by glcanon, visual style by zanzer7, sound editing by Kai Cherry, voice work by Chris 'pudge' Nandor. The WOPR Mod lives @ http://kaisakura.org/cheyenne/"}, "625": {"title": "polar", "category": "Miscellaneous", "author": "Anonymous", "date": "04/30/2007", "size": "1.50 MB", "votes": 8, "stars": 3.625, "downloads": 5011, "identifier": 625, "filepath": "Miscellaneous/625_polar.zip", "description": "This mod changes the world map from its normal projection to a polar projection.  This is what Santa is Seeing when you Destroy the world.  It seems to be one of the more popular mods out there.  Created by hellcatv"}, "626": {"title": "Real Explosions", "category": "Miscellaneous", "author": "Anonymous", "date": "07/16/2007", "size": "1.00 MB", "votes": 10, "stars": 3.6, "downloads": 5171, "identifier": 626, "filepath": "Miscellaneous/626_Real_Explosions.zip", "description": "This mod adds attractive colour explosions to Defcon, replacing the boring white circles of vanilla. A small but beautiful tweak which adds to the stunning interface of the original game. \r\n"}, "627": {"title": "sailableplus", "category": "Miscellaneous", "author": "Anonymous", "date": "06/10/2007", "size": "12.00 kB", "votes": 7, "stars": 3.5714300000000003, "downloads": 3559, "identifier": 627, "filepath": "Miscellaneous/627_sailableplus.zip", "description": "I have seen a lot of complaints about ships getting where they shouldn't (i.e. in the middle of North America on their way to the Hudson Bay). IV are working on a solution. However, in the meantime, I have made an altered version of sailable.bmp, and packaged it into a mod. This version of sailable.bmp removes sailable regions that are completely inaccessible (in North America and in the Mediterranean), and closes up some other very small sailable regions around the world (the Caribbean, near Madagascar, the Sea of Japan, and in Indonesia). It also opens up some areas in the Caribbean (Cuba is sailable), widens out the Bering Strait a bit, widens out the area north of Iceland, and gets rid of a few artifacts. I think this should fix most of the major exploits that people are complaining about. Please, give it a try, and let me know.   If you have questions, please contact me at xhenderson@gmail.com."}, "624": {"title": "asia", "category": "Miscellaneous", "author": "Anonymous", "date": "05/14/2007", "size": "380.00 kB", "votes": 13, "stars": 3.2307699999999997, "downloads": 4281, "identifier": 624, "filepath": "Miscellaneous/624_asia.zip", "description": "This mod replaces the world map, and focuses on Asia.  Japan, the Middle East, India, Russia, Indonesia, and China are all playable.  Created by LeSinge.  More information can be found on the Introversion forums: http://forums.introversion.co.uk/defcon/viewtopic.php?t=4494"}, "3426": {"title": "Defcon-Islands-v1.5", "category": "Graphics", "author": "experiment632", "date": "04/25/2012", "size": "346.00 kB", "votes": 2, "stars": 1.0, "downloads": 1730, "identifier": 3426, "filepath": "FileNotFound", "description": "Defcon map modification which now includes: \r\nHawaiian Islands owned by USA/North America \r\nFalkland Islands owned by UK/European Union \r\n\r\n(Slight error from Version 1.0 fixed: Honolulu now included)"}}