{"2851": {"title": "bardo world.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "1.30 MB", "votes": 14, "stars": 4.642855, "downloads": 2721, "identifier": 2851, "filepath": "Miscellaneous/2851_bardo_world.sit.Bin", "description": "This game is called \"Harry's Adventures in the Bardo World,\" and is the sequel to \"Harry Resurrects the Goddess.\"  This is a beta version.  The game has been finished and tested for a year, but I have never finished the story, and I'm releasing it now, as is, with no story, since I seem incapable of finishing the story anytime soon.\r\n\r\nThe enclosed Read Me text has acknowledgements and lots of tips and tricks, check it out.\r\n\r\nRelease date September 7, 2002 by harryfan23, with graphics help from ebbtide, Nebogipfel, and kidzsoft.\r\n\r\n"}, "2854": {"title": "Goddess.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "1.10 MB", "votes": 16, "stars": 4.5625, "downloads": 2567, "identifier": 2854, "filepath": "Miscellaneous/2854_Goddess.sit.Bin", "description": "This is version 1.1 of the \"Harry Resurrects the Goddess\" world.  It fixes one glaring omission in level 11, and provides a saved game to get you to level 10 if you encounter the \"error determining registration status\" bug at the end of level 9.  There is also a new SimpleText file with some strategic and tactical tips.  Thanks to the many people (765 as of 11/3/02) who downloaded the original version.  Come get this one if you haven't tried the original, or if you did and couldn't get to level 10 and beyond.  Peace."}, "2870": {"title": "Tutorial World", "category": "Miscellaneous", "author": "Anonymous", "date": "04/17/2005", "size": "3.20 MB", "votes": 8, "stars": 4.5, "downloads": 2285, "identifier": 2870, "filepath": "Miscellaneous/2870_Tutorial_World.sit", "description": "This level set is a brief introduction to the Harry engine for those who have not managed to complete Episode One. Included are three levels to help the player through standard tasks that increase in difficultly throughout the set. The final level should prove a challenge to the seasoned Harry Player, as should the reasonably well hidden secret level. Included is a brief teaser for the completion of the world 'Return of Ubermann', to be released soon. A new release from the 'Return of Ubermann Project'."}, "2869": {"title": "TDSOTS", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "1.20 MB", "votes": 14, "stars": 4.357145, "downloads": 2740, "identifier": 2869, "filepath": "Miscellaneous/2869_TDSOTS.sit", "description": "The Dark Side of the Swivel, v 1.0, by Thomas Castiglione\r\n\r\nIn this 12-level, all original world, Harry must travel to the Other Side to stop evil emanations that are threatening ScumCo, of which he is now the CEO. The levels are all completely original designs, and many of the background and foreground tilesets have been modified or created from scratch. There are no new sprites, but there are new 'tricks', puzzles and battles.\r\n\r\nTDSOTS was in fact finished and entered final beta testing a year and a half ago. So why has it been 18 months? Basically, I forgot about it... a hard disk clean having finally jogged my memory, here it is for all to enjoy."}, "2868": {"title": "SwivelWorld v", "category": "Miscellaneous", "author": "Anonymous", "date": "06/06/2006", "size": "4.50 MB", "votes": 10, "stars": 4.2, "downloads": 4130, "identifier": 2868, "filepath": "Miscellaneous/2868_SwivelWorld_v.3", "description": "First of all, I'd just like to give a VERY BIG \"SORRY\" for missing-out a VITAL piece of information, which would instruct the player to update (v.1) to (v.2), in the (v.2) update guide file. It should of been pretty obvious to what I missed-out. I'd just like to say that I have now corrected the omission, and that the guide is now complete! In this version I have created the final 4 levels to the HarryWorld (levels 12-15). I have NOT created any screenshots for these levels though, simply because I had decided a long time ago that I would actually realease a (v.4), which would slightly update every single level! Now, what would be the point of creating, or even having screenshots, that wouldn't be entirely accurate? I have not added any more Extras, but I have go a couple more ideas for these when (v.4) is released. (v.4) will also have imported MIDI files, for the levels that have currently not got a MIDI of their own (levels 1,4,6,10,12,14  15). The MIDI files currently imported for levels 2 ( 13) and 9 will also be updated, to a slightly more 'jazzed-up' version of the allotted tunes! For (v.4) I will also update the read-me file from a 'SimpleText' document, to a 'DOCMaker' document, which has be proven to be capable of havving a lot more text imputted into it than SimpleText! It can also be useful to people who just may not have access to SimpleText, but where DOCMaker is concerned, it seems that any documents made with it can be read, even if the reader doesn't have DOCMaker installed on their computer! I have also decided to 're-word' my speech slightly. For Example, I have usally called a graphic of which Harry can fall down a 'drop-zone', but in the editor, it is referred to as an 'empty space', and so, I will use that speech. Another example would be calling something that appears after an enemy has been destroyed an 'aftermath', of which I have decided isn't particually accurate in meaning, so that action will now be referred to as 're-spawn'. Finally, don't expect to see an update guide in (v.4), because I would have updated SO MANY things - including all of the scrolling-texts (which will be made longer, written in a clearer font, and will reveal any previous 'hidden' plot-points) - I would expect the player to start all the way back in level 01, simply to get the FULL EXPERIENCE of my first ever released HarryWorld - SwivelWorld[TM]. Enjoy (more to come)!!"}, "2855": {"title": "Harry Editor v1.0b3.1 (FAT).sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "294.00 kB", "votes": 10, "stars": 4.0, "downloads": 2016, "identifier": 2855, "filepath": "Miscellaneous/2855_Harry%20Editor%20v1.0b3.1%20(FAT).sit.bin", "description": "This is a beta version of a level editor for Harry the Handsome Executive -- create your own level files!"}, "2856": {"title": "HarryMusic 1stPart", "category": "Miscellaneous", "author": "Anonymous", "date": "12/03/2005", "size": "8.70 MB", "votes": 8, "stars": 4.0, "downloads": 2593, "identifier": 2856, "filepath": "Miscellaneous/2856_HarryMusic_1stPart.zip", "description": "Now you can enjoy the Harry music in iTunes or your iPod! This archive indeed contains the Harry musics in mp3 format. Be aware that this has been no easy feat. Gory details are in the included ReadMe. These musics take enough room that I have split them in three groups this is the FIRST group, containing the musics found in the portion of the game you can play unregistered. If you have any question, praise, or remark about them, please contact me, I'm Zacha Pedro in the Ambrosia software web boards (send a PM of use the mail form of my user profile)."}, "2857": {"title": "HarryMusic 2ndPart", "category": "Miscellaneous", "author": "Anonymous", "date": "12/03/2005", "size": "9.10 MB", "votes": 8, "stars": 4.0, "downloads": 2970, "identifier": 2857, "filepath": "Miscellaneous/2857_HarryMusic_2ndPart.zip", "description": "Now you can enjoy the Harry music in iTunes or your iPod! This archive indeed contains the Harry musics in mp3 format. Be aware that this has been no easy feat. Gory details are in the included ReadMe. These musics take enough room that I have split them in three groups this is the SECOND group, containing the musics of levels 6 to 11 (bounds included). If you have any question, praise, or remark about them, please contact me, I'm Zacha Pedro in the Ambrosia software web boards (send a PM of use the mail form of my user profile)."}, "2858": {"title": "HarryMusic LastPart", "category": "Miscellaneous", "author": "Anonymous", "date": "12/03/2005", "size": "7.80 MB", "votes": 8, "stars": 4.0, "downloads": 2447, "identifier": 2858, "filepath": "Miscellaneous/2858_HarryMusic_LastPart.zip", "description": "Now you can enjoy the Harry music in iTunes or your iPod! This archive indeed contains the Harry musics in mp3 format. Be aware that this has been no easy feat. Gory details are in the included ReadMe. These musics take enough room that I have split them in three groups this is the THIRD group, containing the musics for levels 12 to end, victory and a bonus one. If you have any question, praise, or remark about them, please contact me, I'm Zacha Pedro in the Ambrosia software web boards (send a PM of use the mail form of my user profile)."}, "2862": {"title": "HSGE.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "17.00 kB", "votes": 6, "stars": 3.8333350000000004, "downloads": 3280, "identifier": 2862, "filepath": "Miscellaneous/2862_HSGE.sit.bin", "description": "Harry Saved Game Editor lets you modify save files from the game Harry the Handsome Executive.\r\n\r\nSystem requirements: anything that runs the game itself should be able to run the saved game editor.\r\n\r\nHarry Saved Game Editor is freeware distribute anywhere."}, "2867": {"title": "SwivelWorld v", "category": "Miscellaneous", "author": "Anonymous", "date": "08/21/2005", "size": "2.10 MB", "votes": 7, "stars": 3.7142850000000003, "downloads": 4962, "identifier": 2867, "filepath": "Miscellaneous/2867_SwivelWorld_v.1", "description": "Hi, this is my 1st HarryWorld (to be released)! It is called \"SwivelWorld\u0099\". It is the 1st-of-2 HarryWorlds to be released, in this epic 2-parter adventure!! This is only--version.1, which contains the first 6-levels, out of 15. This HarryWorld has been beta-tested  alpha-tested, making it completable in it's present 'state'! This version (v.1) of this HarryWorld, was released on--21/ 08/ 05 (started on--31/ 05/ 05), at 01:10pm approx.! I have had no help from any of the regular HarryWorld creators--Frogar, harryfan23, Nebogipfel, ect.! I hope you enjoy this 1st instalment of \"SwivelWorld\u0099\", which was created by me, JohnnyBoy!"}, "2853": {"title": "Goddess.hqx", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "1.40 MB", "votes": 10, "stars": 3.6, "downloads": 3135, "identifier": 2853, "filepath": "Miscellaneous/2853_Goddess.hqx.sit", "description": "Here's my Harry world, Harry Resurrects the Goddess. \r\n\r\nI've spent hundreds of hours on it, trying to get it to the same high level\r\nas Episode 1.  Like Ben Spees' original game, mine has a story that runs\r\nthrough it, and I've tied some of the game's effects to the thematic threads\r\nof the story.  For example, the story is about the process of\r\nself-transformation, and level 17, which is titled \"The Dark Night of the\r\nSoul,\" uses all-black background and foreground tiles, so Harry appears to\r\nbe traveling through a black world haunted by sprites.\r\n\r\nThe game also includes a puzzle, and to pass through the first room of the\r\nlast level (level 18, \"Crossing the Abyss\"), the player must negotiate a\r\nmaze.  It could be solved through an arduous process of trial-and-error, but\r\nplayers who figure out the puzzle will be able to sail through it.  I also\r\nmade extensive use of the \"bottomless pit\" feature, and used the hidden\r\nsprite feature to create the game's hardest level, level 16 (aptly named\r\n\"Double Trouble\").\r\n\r\nI hope you like the game.  I had a ton of fun creating it."}, "2865": {"title": "Return of Uberman Demo.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "535.00 kB", "votes": 9, "stars": 3.11111, "downloads": 1922, "identifier": 2865, "filepath": "Miscellaneous/2865_Return%20of%20Uberman%20Demo.sit.bin", "description": "A level file for Harry the Handsome Executive: \"Return of the Uberman!\""}, "2859": {"title": "HarryWorld", "category": "Miscellaneous", "author": "Anonymous", "date": "06/16/2005", "size": "376.00 kB", "votes": 5, "stars": 3.0, "downloads": 2532, "identifier": 2859, "filepath": "Miscellaneous/2859_HarryWorld", "description": "this is a level that me and my friend made it is only 1 level but i hope you like it anyway it is my first submit to ambrosiasw but i love my level and it isnt bad FOR AN 11 year old\r\n\r\nany problems or bugs please email me at aviel@frostandfire.com\r\n\r\nTHIS IS FOR MAC I DO NOT KNOW IF IT WORKS FOR WINDOWS"}, "2861": {"title": "HarryWorldPam.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "1.30 MB", "votes": 7, "stars": 2.714285, "downloads": 2672, "identifier": 2861, "filepath": "Miscellaneous/2861_HarryWorldPam.sit.bin", "description": "After attending a meeting out in Nebraska, Harry returns to ScumCo to go about his work again.  When Harry comes back though, something disturbing has happened Pam has gone missing.  Harry will have to brave three new levels to save Pam and found out the truth behind Uberman's death.\r\n\r\nNote from the Author:  I'm planning a sequel to this, but I'm going to wait till the next version of the level editor is out before I do that.  If you would interested in helping me on this project, feel free to contact me at CB102@aol.com."}, "2871": {"title": "Xznwys Folder.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "378.00 kB", "votes": 10, "stars": 2.3, "downloads": 1393, "identifier": 2871, "filepath": "Miscellaneous/2871_Xznwys%20Folder.sit.Bin", "description": "\tHarry has gone to meet with the two major tech holders at the time (Jelly Bellyª \r\nand Pepsiª) who are about to merge to form Pepsi Belly. At the last moment Pepsiª springs \r\nan attack on the JElly Bellyª building. Harry just happens to enter the building at this\r\nmoment.\r\n\r\nThis is a Bete version (read the read-me for more details on what I want you yo do)."}, "2866": {"title": "Robot Wars1.2", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "23.00 kB", "votes": 6, "stars": 2.166665, "downloads": 1384, "identifier": 2866, "filepath": "Miscellaneous/2866_Robot%20Wars1.2.hqx", "description": "This is the update to robot wars.                                                                            "}, "2863": {"title": "InvertedHARRY", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "2.00 MB", "votes": 3, "stars": 2.0, "downloads": 1914, "identifier": 2863, "filepath": "Miscellaneous/2863_InvertedHARRY.sit", "description": "These two alternative files for the Episode 1 and the graphics files will amke all the graphics for Episcode 1 in the game inverted. This means that all the colours are the opposite! Read the \"Read Me\" file before using and have fun!!!"}, "2864": {"title": "InvertedHarry.sit", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "2.80 MB", "votes": 3, "stars": 2.0, "downloads": 1678, "identifier": 2864, "filepath": "Miscellaneous/2864_InvertedHarry.sit.hqx", "description": "This simple add-on file was created to replace the Episode 1 and graphics files for Harry. It simply inverts all the colours and makes the graphics look wild! This is the intial release of this add-on and was just made for fun. -Enjoy!"}, "2852": {"title": "Episode 2 Demo", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "1.10 MB", "votes": 5, "stars": 1.4, "downloads": 2263, "identifier": 2852, "filepath": "Miscellaneous/2852_Episode_2_Demo", "description": "George, Dr. Ubermann's brother, has enslaved a city, and threatens to take over the world. Join Harry as he fights various soldiers and minions, and finally takes on George himself! Demo version, only 9 levels.\r\n Created by a person known on the Introversion Uplink boards as Maniak."}, "2860": {"title": "HarryWorld8482", "category": "Miscellaneous", "author": "Anonymous", "date": "08/12/2004", "size": "0.00 B", "votes": 3, "stars": 1.0, "downloads": 2168, "identifier": 2860, "filepath": "Miscellaneous/2860_HarryWorld8482", "description": "Makes you be able to be invinsible in many ways like comfort and you're invintory as in keys can add up to as many as 1,000."}}